Repository: vicode-dev/Transcendence
Catalog: services/authentication/app/ft_auth/locale/*/LC_MESSAGES/django.po
Languages: nl

source: English
nl: Engels

source: Spanish
nl: Spaans

source: French
nl: Frans

source: Dutch
nl: Nederlands

source: Login
nl: Inloggen

source: Login Name
nl: Gebruikersnaam

source: Enter login name
nl: Voer gebruikersnaam in

source: Password
nl: Wachtwoord

source: Enter Password
nl: Voer wachtwoord in

source: No account yet ?
nl: Nog geen account?

source: Create one
nl: Maak er een

source: Or
nl: Of

source: login with 42
nl: log in met 42

source: Disconnection
nl: Verbinding verbroken

source: If nothing happens click here
nl: Als er niets gebeurt, klik hier

source: Doublefactor Authentication
nl: Dubbele authenticatie

source: Enter PIN from your app
nl: Voer PIN in vanuit uw app

source: Validate
nl: Valideren

source: It's an error?
nl: Is het een fout?

source: Cancel
nl: Annuleren

source: Register
nl: Registreren

source: First Name
nl: Voornaam

source: Enter your first name
nl: Voer uw voornaam in

source: Last Name
nl: Achternaam

source: Enter your last name
nl: Voer uw achternaam in

source: You already have an account?
nl: Heeft u al een account?

source: Or maybe
nl: Of misschien

source: Token expired
nl: Token verlopen

source: Invalid token
nl: Ongeldige token

source: One or more required fields are empty
nl: Een of meer verplichte velden zijn leeg

source: Your login name isn't an option!
nl: Uw inlognaam is geen optie!

source: Login size must be between 8 and 19 characters.
nl: Inlognaam moet tussen 8 en 19 tekens lang zijn.

source: Your password isn't an option!
nl: Uw wachtwoord is geen optie!

source: Password size must be between 8 and 32 characters.
nl: Wachtwoord moet tussen 8 en 32 tekens lang zijn.

source: Your first name isn't an option!
nl: Uw voornaam is geen optie!

source: Login must contains only alphabetic characters.
nl: Inlognaam mag alleen alfabetische tekens bevatten.

source: First and last names must contain only alphabetic characters and spaces.
nl: Voor- en achternamen mogen alleen alfabetische tekens en spaties bevatten.

source: Login already exists.
nl: Inlognaam bestaat al.

source: You forgot to specify your login name.
nl: U bent vergeten uw inlognaam op te geven.

source: You forgot to specify your password.
nl: U bent vergeten uw wachtwoord op te geven.

source: Login and password do not match.
nl: Inlognaam en wachtwoord komen niet overeen.

source: User creation failed, try later.
nl: Gebruikersaanmaak mislukt, probeer later opnieuw.

source: User login failed, try later.
nl: Gebruikerslogin mislukt, probeer later opnieuw.
